from app.auth.signup import signup

def main():
    input("───────────────────────────────────────\n"
      "           필라테스 예약 관리 시스템          \n"
      "───────────────────────────────────────\n"
      ">> ")

    data, time = input("───────────────────────────────────────\n"
      "현재 날짜와 시간을 입력하세요.\n"
      "날짜는 YYMMDD 형식, 시간은 24시간제 HH:MM형식입니다.\n\n"
      "예시: 240408,13:30\n"
      "───────────────────────────────────────\n"
      "날짜 (YYMMDD),시간(HH:MM)>> ").split(',')
    
    user_type = input("───────────────────────────────────────\n"
      "1. 회원\n"
      "2. 강사\n"
      "3. 종료\n"
      "───────────────────────────────────────\n"
      "숫자를 입력해주세요 >> ")
    
    choice = input("───────────────────────────────────────\n"
      "1. 회원가입\n"
      "2. 로그인\n"
      "3. 시작 메뉴로 돌아가기\n"
      "───────────────────────────────────────\n"
      "숫자를 입력해주세요 >> ")

    if choice == '1':
        signup(user_type)
    elif choice == '2':
        # 로그인은 아직 미구현
        print("⚠ 로그인 기능은 준비 중입니다.")

if __name__ == '__main__':
    main()